In [2]:
import pandas as pd

In [3]:
dict1 = {'Name':['Zoe', 'Iky', 'Mona', 'Sri', 'Juni', 'Muh', 'Selena'],
         'Marks':[98, 89, 99, 87, 90, 83, 99],
         'Gender':['Female', 'Male', 'Female', 'Female', 'Male', 'Male','Female']}

df1 = pd.DataFrame(dict1)
df1

     Name  Marks  Gender
0     Zoe     98  Female
1     Iky     89    Male
2    Mona     99  Female
3     Sri     87  Female
4    Juni     90    Male
5     Muh     83    Male
6  Selena     99  Female

display top 3 of the data set

In [4]:
df1.head(3)

   Name  Marks  Gender
0   Zoe     98  Female
1   Iky     89    Male
2  Mona     99  Female

display last 3 raw of the data set

In [5]:
df1.tail(3)

     Name  Marks  Gender
4    Juni     90    Male
5     Muh     83    Male
6  Selena     99  Female

find shape of our dataset (Number of rows and number of columns)

In [6]:
df1.shape

(7, 3)

In [8]:
print(f'Number of rows: {df1.shape[0]}')
print(f'Number of columns: {df1.shape[1]}')

Number of rows: 7
Number of columns: 3

get information about our dataset like total number rows, total number of columns, datatypes of each column and memory requirement

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

check null value in the dataset

In [11]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

get overall statistic about the dataframe

In [12]:
df1.describe()
#numerical column only

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

find unique value from the gender column

In [13]:
df1

     Name  Marks  Gender
0     Zoe     98  Female
1     Iky     89    Male
2    Mona     99  Female
3     Sri     87  Female
4    Juni     90    Male
5     Muh     83    Male
6  Selena     99  Female

In [14]:
df1['Gender']

0    Female
1      Male
2    Female
3    Female
4      Male
5      Male
6    Female
Name: Gender, dtype: object

In [15]:
df1.loc[df1['Gender']=='Female']

     Name  Marks  Gender
0     Zoe     98  Female
2    Mona     99  Female
3     Sri     87  Female
6  Selena     99  Female

find the number of unique values from the gender column

In [16]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

display count of unique values in gender column

In [17]:
df1['Gender'].value_counts()
#how many time occures

Female    4
Male      3
Name: Gender, dtype: int64

find total number of students having marks between 90 to 100 (inclusive) using between methode

In [18]:
# df1['Marks'] >=90
df1[df1['Marks']>=90]

     Name  Marks  Gender
0     Zoe     98  Female
2    Mona     99  Female
4    Juni     90    Male
6  Selena     99  Female

In [20]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [19]:
data = df1[df1['Marks'].between(90, 100)]
total = sum(df1['Marks'].between(90, 100))

print(data)
print("----------------------------")
print(f'total of students: {total}')

     Name  Marks  Gender
0     Zoe     98  Female
2    Mona     99  Female
4    Juni     90    Male
6  Selena     99  Female
----------------------------
total of students: 4

find average of the dataset

In [21]:
meandf = df1['Marks'].mean()
maxdf = df1['Marks'].max()
mindf = df1['Marks'].min()

apply method

In [22]:
def marks(x):
    return x/2

In [23]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [45]:
#add new column
df1['Half Marks']=df1['Marks'].apply(marks)
df1

     Name  Marks  Gender  New Gender  Half Marks
0     Zoe     98  Female           0        49.0
1     Iky     89    Male           1        44.5
2    Mona     99  Female           0        49.5
3     Sri     87  Female           0        43.5
4    Juni     90    Male           1        45.0
5     Muh     83    Male           1        41.5
6  Selena     99  Female           0        49.5

In [46]:
#using lambda function
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [47]:
df1['Name'].apply(len)

0    3
1    3
2    4
3    3
4    4
5    3
6    6
Name: Name, dtype: int64

map function

In [48]:
df1

     Name  Marks  Gender  New Gender  Half Marks
0     Zoe     98  Female           0        49.0
1     Iky     89    Male           1        44.5
2    Mona     99  Female           0        49.5
3     Sri     87  Female           0        43.5
4    Juni     90    Male           1        45.0
5     Muh     83    Male           1        41.5
6  Selena     99  Female           0        49.5

In [49]:
df1['New Gender']=df1['Gender'].map({'Male': 1, 'Female':0})
#map fucntion for encoding fucntion
df1

     Name  Marks  Gender  New Gender  Half Marks
0     Zoe     98  Female           0        49.0
1     Iky     89    Male           1        44.5
2    Mona     99  Female           0        49.5
3     Sri     87  Female           0        43.5
4    Juni     90    Male           1        45.0
5     Muh     83    Male           1        41.5
6  Selena     99  Female           0        49.5

drop column

In [50]:
df1.drop(['New Gender', 'Half Marks'], axis=1, inplace=True) #drop 2 column
#if want to modify existing data frame --> inplace true

In [51]:
df1

     Name  Marks  Gender
0     Zoe     98  Female
1     Iky     89    Male
2    Mona     99  Female
3     Sri     87  Female
4    Juni     90    Male
5     Muh     83    Male
6  Selena     99  Female

print name of the columns

In [52]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [53]:
df1.index

RangeIndex(start=0, stop=7, step=1)

sort the data frame

In [54]:
df1

     Name  Marks  Gender
0     Zoe     98  Female
1     Iky     89    Male
2    Mona     99  Female
3     Sri     87  Female
4    Juni     90    Male
5     Muh     83    Male
6  Selena     99  Female

In [57]:
df1.sort_values(by='Marks', ascending=True) #dari ekcil ke besar

     Name  Marks  Gender
5     Muh     83    Male
3     Sri     87  Female
1     Iky     89    Male
4    Juni     90    Male
0     Zoe     98  Female
2    Mona     99  Female
6  Selena     99  Female